{
    "healthy": {
        "name": "สภาพปกติ",
        "description": "",
        "apperance": [
            
        ],
        "cause": [],
        "fix": [],
        "source": [],
        "exp_img_path" : "h.JPG"
    },
    "nitrogen": {
        "name": "การขาดไนโตรเจน",
        "description": "การขาดไนโตรเจน (Nitrogen) หรือ (N) ที่เป็นสารอาหารที่จำเป็นสำหรับพืช มีบทบาทสำคัญในการเจริญเติบโตและพัฒนาการของพืชทุกชนิด ถ้าขาดไปจะเจริญเติบโตแคระแกร็น และผลผลิตลดลง",
        "apperance": [
            "ใบล่างของกัญชาจะเริ่มมีสีเหลือง",
            "ใบจะเริ่มมีสีเหลืองมากขึ้น (คลอโรซีส)",
            "ใบเหลืองอยากรวดเร็วจากใบด้านล่างจนถึงยอด",
            "ใบอาจเล็กลงและบางกว่าปกติ"
        ],
        "cause": ["ดินไม่สามารถดูดซับไนโตรเจนเข้าสู่ใบพืชได้อย่างเหมาะสม ดินมีความอุดมสมบูรณ์ต่ำ ค่า pH สูง และปริมาณอินทรียวัตถุต่ำ นอกจากนี้ ปริมาณน้ำฝนหรือการให้น้ำที่มากเกินไปสามารถชะล้างไนโตรเจนออกจากดิน ทำให้พืชไม่สามารถนำไปใช้ได้"],
        "fix": ["การใส่ปุ๋ยที่มีไนโตรเจนสูง เช่น แอมโมเนียมไนเตรตหรือยูเรีย สามารถใช้ปุ๋ยอินทรีย์ เช่น เลือดป่น ปลาป่น และกระดูกป่น นอกจากนี้ การปลูกพืชหมุนเวียนและการปลูกพืชแซมร่วมกับพืชตรึงไนโตรเจนสามารถช่วยปรับปรุงความอุดมสมบูรณ์ของดินและความพร้อมใช้ของไนโตรเจน"],
        "source": ["https://herbiware.com/blog/a-visual-guide-to-cannabis-deficiencies"],
        "img_path" : "n.JPG"
    },
    "phosphorus": {
        "name": "การขาดฟอสฟอรัส",
        "description": "ฟอสฟอรัสก็มีส่วนสำคัญที่ช่วยในการสังเคราะห์แสง มีส่วนช่วยในการผลิตแป้งและน้ำตาล ฟอสฟอรัสมีส่วนช่วยในการเปลี่ยนพลังงานแสงอาทิตย์เป็นพลังงานทางเคมีในพืช ช่วยผลิตอาหาร มีส่วนช่วยในการเจริฐเติบโต กระตุ้นการออกดอกและการเจริญเติบโตของราก ฟอสฟอรัสก็จะมีอยู่ในปุ๋ยหมัก เศษอาหารและกระดูกป่นเช่นกัน จะเห็นได้ว่าฟอสฟอรัสก็มีส่วนสำคัญไม่แพ้ธาตุอาหารใด ๆ เลย",
        "apperance": [
            "ช่วงใบเป็นด่างสีน้ำตาล หรือสีทองเป็นวงใหญ่",
            "อาจพบอาการลำต้นและก้านใบมีสีม่วงปรากฎร่วม"
        ],
        "cause": ["ขาดสารอาหารประเภทฟอสฟอรัส มีฟอสฟอรัสไม่เพียงพอสำหรับตาที่จะเติบโตอย่างถูกต้องในช่วงก่อนออกดอก"],
        "fix": ["แก้ไขด้วยการฉีดพ่นปุ๋ยโมโนโพแทสเซียมฟอสเฟต/ปุ๋ยหมัก (อัตราตามฉลากของแต่ละยี่ห้อ) หรือการใส่หินฟอสเฟต (Rock Phosphate) ในวัสดุปลูก แต่ในส่วนที่เสียหายจะไม่สามารถแก้ไขได้ ส่วนที่เจริญเติบโตใหม่ที่เป็นปกติถึงจะแสดงผลว่าแก้ไขปัญหาดังกล่าวนี้ได้"],
        "source": ["https://www.pantonmai.com/phosphorus-deficiency-in-cannabis-plants/"],
        "img_path" : "p.JPG"
    },
    "calcium": {
        "name": "การขาดแคลเซียม",
        "description" : "แคลเซียมช่วยในการแบ่งเซลล์ ผสมเกสร การงอกของเมล็ด มีส่วนสำคัญต่อโครงสร้างของเซลล์พืช ช่วยในการลำเลียงอาหาร แคลเซียมช่วยในการปรับสมดุลทั้งกรดและด่างของพืช",
        "apperance": [
            "จุดสีน้ําตาลเล็ก ๆ ที่มีลักษณะแคระแกรนหรือการเจริญเติบโตที่ผิดปกติ (ส่งผลให้ใบผิดรูป)",
            "ปรากฎที่ใบอ่อน และใบมีลักษณะจุดเป็นแผลบนใบพืชเนื่องจากเซลล์ตาย"
        ],
        "cause": ["ขาดธาตุแคลเซียม ส่วนใหญ่พบในพื้นที่ดินทราบและดินเป็นกรดจัด"],
        "fix": ["การฉีดพ่นแคลเซียมไนเตรต ฉีดพ่นทางใบ หรือการใส่โดโลไมต์ภายในแปลง"],
        "source": ["https://www.pantonmai.com/calcium-deficiency-symptoms-in-cannabis-plants/"],
        "img_path" : "ca.JPG"
    },
    "caterpillar": {
        "name": "หนอนกินใบ",
        "description" : "อาการของต้นกัญชาที่ถูกหนอนแทะนั้นไม่ต่างกับรอยที่ตั๊กแตนฝากไว้ ซึ่งอาจจะมีขนาดใหญ่กว่ารอยจริ้งหรีด มีส่วนของต้นที่แหว่ง ขาด โดยส่วนที่เห็นชัดที่สุดคือบริเวณใบ",
        "apperance": [
            "แหว่ง ขาด ตามตำแหน่งต่าง ๆ ของลำต้นซึ่งเกิดจากการกัดกิน โดยส่วนที่เห็นชัดที่สุดคือบริเวณใบ"
        ],
        "cause": ["การหาอาหารตามธรรมชาติของแมลงหรือศัตรูพืช โดยกัญชาที่ปลูกภายนอกจะง่ายต่อการเป็นเหยื่อมากที่สุด"],
        "fix": ["จับด้วยมือเปล่า การจับแมลงกวนด้วยมือเป็นวิธีการที่ดีที่สุดเพราะไม่ต้องเสียเงินซื้อสารเคมีหรือยาต่าง ๆ ที่สำคัญเจ้าหนอนผีเสื้อมักเคลื่อนไหวช้าและมองเห็นได้ชัดด้วยสีสันของมัน",
        "ผลิตภัณฑ์ฆ่าหนอนผีเสื้อโดยแบคทีเรีย แม้จะฟังดูโหดร้ายแต่การใช้วิธีนี้เหมาะกับการใช้กำจัดหนอนผีเสื้อที่มีจำนวนมาก โดยแบคทีเรียจะทำให้เจ้าหนอนไม่สามารถกินอาหารได้และตายลง ไม่เป็นอันตรายต่อสัตว์นักล่าที่ให้คุณอย่างแมงมุม สามารถใช้ฉีดทุกสัปดาห์จนกว่าจะไม่เห็นเจ้าหนอนอีกต่อไป"
    ],
        "source": ["https://growstuffshop.com/%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%83%E0%B8%99%E0%B8%95%E0%B9%89%E0%B8%99%E0%B8%81%E0%B8%B1%E0%B8%8D%E0%B8%8A%E0%B8%B2-bible-part-1#:~:text=%E0%B8%AB%E0%B8%99%E0%B8%AD%E0%B8%99%E0%B8%9C%E0%B8%B5%E0%B9%80%E0%B8%AA%E0%B8%B7%E0%B9%89%E0%B8%AD%20(Caterpillars)%20%E0%B8%84%E0%B8%B7%E0%B8%AD%E0%B8%A3%E0%B8%B0%E0%B8%A2%E0%B8%B0,%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%AB%E0%B8%A2%E0%B8%B8%E0%B8%94%E0%B9%80%E0%B8%95%E0%B8%B4%E0%B8%9A%E0%B9%82%E0%B8%95%E0%B8%82%E0%B8%AD%E0%B8%87%E0%B8%9E%E0%B8%B7%E0%B8%8A"],
        "img_path" : "cat.JPG"
    },
    "leafminer": {
        "name": "หนอนชอนใบ",
        "description" : "อาการของต้นกัญชาที่ถูกหนอนชอบใบนั้นจะแสดงเป็นลักษณะเส้นทางยาวตามใบ",
        "apperance": [
            "อาการของต้นกัญชาที่ถูกหนอนชอบใบนั้นจะแสดงเป็นลักษณะเส้นทางยาวตามใบ"
        ],
        "cause": ["สาเหตุมาจากศัตรูธรรมชาติของพืช ซึ่งหนอนชอนใบนั้นจะสามารถแพร่พันธุ์ได้เร็วขึ้น เมื่อมีสภาพอากาศร้อนชื้น หรือฝนตกเกิดจากผีเสื้อ",
                "ผีเสื้อแมลงและแมลงปีกแข็งที่มาวางไข่บนใบจนเกิดเป็นตัวหนอน กัดกินแล้วสอดตัวเข้าไปในใต้ผิวของใบเพื่อค่อย ๆ คืบคลานแล้วกัดกินเนื้อเยื่อของใบ"],
        "fix": ["เด็ดใบที่ได้รับผลกระทบออกหากเป็นไปได้",
                "ใช้สารฆ่าแมลงทางชีวภาพ"],
        "source": ["Facebook Page: HERO WEED 31:  https://www.facebook.com/554209068100927/photos/pb.100064333106144.-2207520000./743047145883784/?type=3"],
        "img_path" : "leaf.JPG"
    }
}